// Lab_03_3.cpp  
// < прізвище, ім’я автора > 
// Лабораторна робота № 3.3 
// Розгалуження, задане графіком функції. 
// Варіант 0.1 

#include <iostream> 
#include <cmath> 
using namespace std;

int main()
{
    double x; // вхідний аргумент 
    double R; // вхідний параметр 
    double y; // результат обчислення виразу 

    // Введення значень 
    cout << "R = "; cin >> R;
    cout << "x = "; cin >> x;

    // Розгалуження в залежності від значення x 
    if (x <= -R) {
        y = -8;  // для x <= -R, значення y фіксоване на рівні -8 
    }
    else if (-R < x && x <= 0) {
        y = (3.0 / R) * (x + R) - 2;  // лінійна частина від -R до 0 
    }
    else if (0 < x && x <= R) {
        y = -sqrt(R * R - x * x);  // частина кола з центром у точці (0, 0) 
    }
    else if (R < x && x <= 5) {
        y = (1.0 / (5 - R)) * (x - R) + 2;  // лінійна частина від R до 5 
    }
    else {
        y = 3;  // для x > 5, значення y фіксоване на рівні 3 
    }

    // Виведення результату 
    cout << "y = " << y << endl;

    return 0;
}